Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: A simple helper can be registered with the function L<Mojolicious::Lite/"helper"> to make our model available to all actions and templates.
ja: A simple helper can be registered with the function [[Mojolicious::Lite/"helper"]] to make our model available to all actions and templates.

source: A slightly modified version of the pattern moving some application logic into the I<controller> is the foundation of pretty much every web framework these days, including L<Mojolicious>.
ja: A slightly modified version of the pattern moving some application logic into the I<controller> is the foundation of pretty much every web framework these days, including [[Mojolicious]].

source: A tiny wrapper around L<DBD::Pg> that makes L<PostgreSQL|http://www.postgresql.org> a lot of fun to use with L<Mojolicious>.
ja: A tiny wrapper around [[DBD::Pg]] that makes [[PostgreSQL|http://www.postgresql.org]] a lot of fun to use with [[Mojolicious]].

source: A true value may be used to pass along additional information which can then be retrieved with L<Mojolicious::Validator::Validation/"error">.
ja: A true value may be used to pass along additional information which can then be retrieved with [[Mojolicious::Validator::Validation/"error"]].

source: A very easy way to make placeholders more restrictive are alternatives, you just make a list of possible values.
ja: プレースホルダーにより多くの制約を加えるには、選択肢を使うのが一番簡単です。候補となる値のリストを作るだけでOKです。

source: Accept TCP/IP and UNIX domain socket connections with L<Mojo::IOLoop::Server> and create stream objects (usually L<Mojo::IOLoop::Stream>, takes the same arguments as L<Mojo::IOLoop::Server/"listen">.
ja: Accept TCP/IP and UNIX domain socket connections with [[Mojo::IOLoop::Server]] and create stream objects (usually [[Mojo::IOLoop::Stream]], takes the same arguments as [[Mojo::IOLoop::Server/"listen"]].

source: Access C<multipart/form-data> file uploads, usually L<Mojo::Upload> objects.
ja: Access C<multipart/form-data> file uploads, usually [[Mojo::Upload]] objects.

source: Access application with L<Mojo::UserAgent::Server/"app">.
ja: Access application with [[Mojo::UserAgent::Server/"app"]].

source: Access message cookies, usually L<Mojo::Cookie::Request> or L<Mojo::Cookie::Response> objects.
ja: Access message cookies, usually [[Mojo::Cookie::Request]] or [[Mojo::Cookie::Response]] objects.

source: Access request cookies, usually L<Mojo::Cookie::Request> objects.
ja: Access request cookies, usually [[Mojo::Cookie::Request]] objects.

source: Access response cookies, usually L<Mojo::Cookie::Response> objects.
ja: Access response cookies, usually [[Mojo::Cookie::Response]] objects.

source: Access validated values, defaults to the current L</"topic">.
ja: Access validated values, defaults to the current [[/"topic"]].

source: Activate reverse proxy support, which allows for the C<X-Forwarded-For> and C<X-Forwarded-Proto> headers to be picked up automatically, defaults to the value of L<Mojo::Server/"reverse_proxy">.
ja: Activate reverse proxy support, which allows for the C<X-Forwarded-For> and C<X-Forwarded-Proto> headers to be picked up automatically, defaults to the value of [[Mojo::Server/"reverse_proxy"]].

source: Add a new helper with L<Mojolicious/"helper">.
ja: Add a new helper with [[Mojolicious/"helper"]].

source: Add chunk of data and upgrade to L<Mojo::Asset::File> object if necessary.
ja: Add chunk of data and upgrade to [[Mojo::Asset::File]] object if necessary.

source: Add multiple L<Mojo::Cookie::Response> objects to the jar.
ja: Add multiple [[Mojo::Cookie::Response]] objects to the jar.

source: Adding a configuration file to your application is as easy as adding a file to its home directory and loading the plugin L<Mojolicious::Plugin::Config>.
ja: Adding a configuration file to your application is as easy as adding a file to its home directory and loading the plugin [[Mojolicious::Plugin::Config]].

source: After reading the L<Mojolicious::Guides::Tutorial>, you should already be familiar with L<Mojo::Server::Morbo>.
ja: After reading the [[Mojolicious::Guides::Tutorial]], you should already be familiar with [[Mojo::Server::Morbo]].

source: After you start a new route with methods like L<Mojolicious::Routes::Route/"get">, you can also give it a destination in the form of a hash using the chained method L<Mojolicious::Routes::Route/"to">.
ja: After you start a new route with methods like [[Mojolicious::Routes::Route/"get"]], you can also give it a destination in the form of a hash using the chained method [[Mojolicious::Routes::Route/"to"]].

source: Alias for L</"E:link">.
ja: Alias for [[/"E:link"]].

source: Alias for L</"attr">.
ja: Alias for [[/"attr"]].

source: Alias for L</"child_nodes">.
ja: Alias for [[/"child_nodes"]].

source: Alias for L</"pairs">.
ja: Alias for [[/"pairs"]].

source: Alias for L</"parts">.
ja: Alias for [[/"parts"]].

source: Alias for L</"tag">.
ja: Alias for [[/"tag"]].

source: Alias for L</"to_array">.
ja: Alias for [[/"to_array"]].

source: Alias for L</"to_string">.
ja: Alias for [[/"to_string"]].

source: Alias for L<Mojo::Base/"tap">.
ja: Alias for [[Mojo::Base/"tap"]].

source: Alias for L<Mojo::Base/"with_roles">.
ja: Alias for [[Mojo::Base/"with_roles"]].

source: Alias for L<Mojo::DOM/"new_tag">.
ja: Alias for [[Mojo::DOM/"new_tag"]].

source: Alias for L<Mojolicious/"config">.
ja: Alias for [[Mojolicious/"config"]].

source: Alias for L<Mojolicious/"ua">.
ja: Alias for [[Mojolicious/"ua"]].

source: Alias for L<Mojolicious::Controller/"app">.
ja: Alias for [[Mojolicious::Controller/"app"]].

source: Alias for L<Mojolicious::Controller/"param">.
ja: Alias for [[Mojolicious::Controller/"param"]].

source: Alias for L<Mojolicious::Controller/"render_to_string">.
ja: Alias for [[Mojolicious::Controller/"render_to_string"]].

source: Alias for L<Mojolicious::Controller/"session">.
ja: Alias for [[Mojolicious::Controller/"session"]].

source: Alias for L<Mojolicious::Controller/"stash">.
ja: Alias for [[Mojolicious::Controller/"stash"]].

source: Alias for L<Mojolicious::Controller/"url_for">.
ja: Alias for [[Mojolicious::Controller/"url_for"]].

source: All selectors from L<Mojo::DOM::CSS/"SELECTORS"> are supported.
ja: All selectors from [[Mojo::DOM::CSS/"SELECTORS"]] are supported.

source: All uppercase methods as well as those starting with an underscore are automatically hidden from the router and you can use L<Mojolicious::Routes/"hide"> to add additional ones.
ja: All uppercase methods as well as those starting with an underscore are automatically hidden from the router and you can use [[Mojolicious::Routes/"hide"]] to add additional ones.

source: All C<GET> and C<POST> parameters extracted from the query string and C<application/x-www-form-urlencoded> or C<multipart/form-data> message body, usually a L<Mojo::Parameters> object.
ja: All C<GET> and C<POST> parameters extracted from the query string and C<application/x-www-form-urlencoded> or C<multipart/form-data> message body, usually a [[Mojo::Parameters]] object.

source: All C<GET> and C<POST> parameters sent with the request are accessible via L<Mojolicious::Controller/"param">.
ja: すべてのC<GET>とC<POST>パラメーターは[[Mojolicious::Controller]]のC<param>を通じてアクセスできます。

source: All C<GET> parameters, usually a L<Mojo::Parameters> object.
ja: All C<GET> parameters, usually a [[Mojo::Parameters]] object.

source: All C<multipart/form-data> file uploads, usually L<Mojo::Upload> objects.
ja: All C<multipart/form-data> file uploads, usually [[Mojo::Upload]] objects.

source: All L<Mojolicious::Controller> controllers are plain old Perl classes and get instantiated on demand.
ja: All [[Mojolicious::Controller]] controllers are plain old Perl classes and get instantiated on demand.

source: All built-in web servers use non-blocking I/O and are based on the L<Mojo::IOLoop> event loop, which provides many very powerful features that allow real-time web applications to scale up to thousands of concurrent client connections.
ja: All built-in web servers use non-blocking I/O and are based on the [[Mojo::IOLoop]] event loop, which provides many very powerful features that allow real-time web applications to scale up to thousands of concurrent client connections.

source: All checks from L<Mojolicious::Validator/"CHECKS"> are supported.
ja: All checks from [[Mojolicious::Validator/"CHECKS"]] are supported.

source: All code contributions should be sent as L<GitHub pull requests|https://help.github.com/articles/using-pull-requests>.
ja: All code contributions should be sent as [[GitHub pull requests|https://help.github.com/articles/using-pull-requests]].

source: All connections will be reset automatically if a new process has been forked, this allows multiple processes to share the same L<Mojo::UserAgent> object safely.
ja: All connections will be reset automatically if a new process has been forked, this allows multiple processes to share the same [[Mojo::UserAgent]] object safely.

source: All data gets serialized with L<Mojo::JSON> and stored Base64 encoded on the client-side, but is protected from unwanted changes with a HMAC-SHA1 signature.
ja: All data gets serialized with [[Mojo::JSON]] and stored Base64 encoded on the client-side, but is protected from unwanted changes with a HMAC-SHA1 signature.

source: All files uploaded via C<multipart/form-data> request are automatically available as L<Mojo::Upload> objects from L<Mojolicious::Controller/"param">.
ja: ファイルは、C<multipart/form-data>リクエストを通してアップロードされると、自動的に [[Mojolicious::Controller]]のC<param>から[[Mojo::Upload]]のインスタンスとして利用可能になります。

source: All filters from L<Mojolicious::Validator/"FILTERS"> are supported.
ja: All filters from [[Mojolicious::Validator/"FILTERS"]] are supported.

source: All following routes are only evaluated if the callback returned a true value.
ja: 以降のすべてのルーティングは、underコールバックが真値を返したときだけ評価されます。

source: All messages will be written to C<STDERR> or a C<log/$mode.log> file if a C<log> directory exists.
ja: すべてのメッセージはC<STDERR>に出力されるか、 C<log>ディレクトリが存在する場合はC<log/$mode.log>に出力されます。

source: All placeholders get compiled to a regular expression internally, this process can also be customized.
ja: すべてのプレースホルダーは、内部で正規表現にコンパイルされます。この処理はカスタマイズすることもできます。

source: All placeholders require a value, but by assigning them default values you can make capturing optional.
ja: すべてのプレースホルダーは値を必要としますが、 プレースホルダーにデフォルト値を設定することにより キャプチャをオプショナルなものにすることができます。

source: All routes can have a name associated with them, this allows automatic template detection and backreferencing with L<Mojolicious::Controller/"url_for">, on which many methods and helpers like L<Mojolicious::Plugin::TagHelpers/"link_to"> rely.
ja: すべてのルーティング(routes)には名前を付けることができます。名前を付けることによってテンプレートの自動検出や[[Mojolicious::Controller]]のC<url_for>による逆引きができるようになり、[[Mojolicious::Plugin::TagHelpers]]のC<link_to>など、多くのヘルパーやメソッドがこれに基づいて動きます。

source: All templates and static files inlined in the C<DATA> section can be automatically turned into separate files in the C<templates> and C<public> directories with the command L<Mojolicious::Command::Author::inflate>.
ja: All templates and static files inlined in the C<DATA> section can be automatically turned into separate files in the C<templates> and C<public> directories with the command [[Mojolicious::Command::Author::inflate]].

source: All templates should be in the C<templates> directories of the application, which can be customized with L<Mojolicious::Renderer/"paths">, or one of the the C<DATA> sections from L<Mojolicious::Renderer/"classes">.
ja: All templates should be in the C<templates> directories of the application, which can be customized with [[Mojolicious::Renderer/"paths"]], or one of the the C<DATA> sections from [[Mojolicious::Renderer/"classes">.

source: All those settings are then available through the method L<Mojolicious/"config"> and the helper L<Mojolicious::Plugin::DefaultHelpers/"config">.
ja: All those settings are then available through the method [[Mojolicious/"config"]] and the helper [[Mojolicious::Plugin::DefaultHelpers/"config"]].

source: All unknown fields will be ignored by default, so you have to decide which should be L<required|Mojolicious::Validator::Validation/"required"> or L<optional|Mojolicious::Validator::Validation/"optional"> before you can perform checks on their values.
ja: All unknown fields will be ignored by default, so you have to decide which should be [[required|Mojolicious::Validator::Validation/"required"]] or [[optional|Mojolicious::Validator::Validation/"optional"]] before you can perform checks on their values.

source: All web development starts with HTML, CSS and JavaScript, to learn the basics we recommend the L<Mozilla Developer Network|https://developer.mozilla.org/en-US/docs/Web>.
ja: All web development starts with HTML, CSS and JavaScript, to learn the basics we recommend the [[Mozilla Developer Network|https://developer.mozilla.org/en-US/docs/Web]].

source: All you have to do, is to add a new C<handler> with L<Mojolicious::Renderer/"add_handler"> when C<register> is called.
ja: All you have to do, is to add a new C<handler> with [[Mojolicious::Renderer/"add_handler"]] when C<register> is called.

source: All you have to do, to protect your users from this, is to add an additional hidden field to your forms with L<Mojolicious::Plugin::TagHelpers/"csrf_field">, and validate it with L<Mojolicious::Validator::Validation/"csrf_protect">.
ja: All you have to do, to protect your users from this, is to add an additional hidden field to your forms with [[Mojolicious::Plugin::TagHelpers/"csrf_field"]], and validate it with [[Mojolicious::Validator::Validation/"csrf_protect"]].

source: Allow L</"under"> semantics for this route.
ja: Allow [[/"under"]] semantics for this route.

source: Almost all features are exactly the same for full L<Mojolicious> applications.
ja: Almost all features are exactly the same for full [[Mojolicious]] applications.

source: Almost everything you'll learn here also applies to full L<Mojolicious> applications.
ja: ここで学んだことは、ほとんどすべてがフルバージョンの[[Mojolicious]]アプリケーションにも当てはまります。

source: Also note that for convenience the C<PIPE> signal will be set to C<IGNORE> when L<Mojo::IOLoop> is loaded.
ja: Also note that for convenience the C<PIPE> signal will be set to C<IGNORE> when [[Mojo::IOLoop]] is loaded.

source: Also sets the stash value C<snapshot> to a copy of the L</"stash"> for use in the templates.
ja: Also sets the stash value C<snapshot> to a copy of the [[/"stash"]] for use in the templates.

source: Also sets the stash values C<exception> to a L<Mojo::Exception> object and C<snapshot> to a copy of the L</"stash"> for use in the templates.
ja: Also sets the stash values C<exception> to a [[Mojo::Exception]] object and C<snapshot> to a copy of the [[/"stash"]] for use in the templates.

source: Also sets up the renderer, static file server, a default set of plugins and an L</"around_dispatch"> hook with the default exception handling.
ja: Also sets up the renderer, static file server, a default set of plugins and an [[/"around_dispatch"]] hook with the default exception handling.

source: Alternatively you can also use configuration files in the JSON format with L<Mojolicious::Plugin::JSONConfig>.
ja: Alternatively you can also use configuration files in the JSON format with [[Mojolicious::Plugin::JSONConfig]].

source: An C<E> element that belongs to the namespace alias C<A> from L<CSS Namespaces Module Level 3|https://www.w3.org/TR/css-namespaces-3/>.
ja: An C<E> element that belongs to the namespace alias C<A> from [[CSS Namespaces Module Level 3|https://www.w3.org/TR/css-namespaces-3/]].

source: An amazing real-time web framework built on top of the powerful L<Mojo> web development toolkit.
ja: An amazing real-time web framework built on top of the powerful [[Mojo]] web development toolkit.

source: An optional JSON Pointer can be used to extract a specific value with L<Mojo::JSON::Pointer>.
ja: An optional JSON Pointer can be used to extract a specific value with [[Mojo::JSON::Pointer]].

source: And if you want to know more about how browsers and web servers actually communicate, there's also a very nice introduction to L<HTTP|https://developer.mozilla.org/en-US/docs/Web/HTTP>.
ja: And if you want to know more about how browsers and web servers actually communicate, there's also a very nice introduction to [[HTTP|https://developer.mozilla.org/en-US/docs/Web/HTTP]].

source: And don't worry about revealing too much information on these pages, they are only available during development, and will be replaced automatically with pages that don't reveal any sensitive information in a production environment.
ja: ページに情報が見えすぎるからといって心配しないでください。これが有効になるのは開発中だけです。プロダクション環境では、大切な情報が表示されないページに自動的に置き換わります。

source: And if that's not enough you can also serve them manually with L<Mojolicious::Plugin::DefaultHelpers/"reply-E<gt>static"> and L<Mojolicious::Plugin::DefaultHelpers/"reply-E<gt>file">.
ja: And if that's not enough you can also serve them manually with [[Mojolicious::Plugin::DefaultHelpers/"reply-E<gt]]static"]] and [[Mojolicious::Plugin::DefaultHelpers/"reply-E<gt]]file"]].

source: And if that's not the case you might be missing the L<Mozilla::CA> module, which is often required by L<IO::Socket::SSL> to be able to verify certificates.
ja: And if that's not the case you might be missing the [[Mozilla::CA]] module, which is often required by [[IO::Socket::SSL]] to be able to verify certificates.

source: And if you have a C<PAUSE> account (which can be requested at L<http://pause.perl.org>), you are only a few commands away from releasing it to CPAN.
ja: And if you have a C<PAUSE> account (which can be requested at [[http://pause.perl.org]]), you are only a few commands away from releasing it to CPAN.

source: And if you have a PAUSE account (which can be requested at L<http://pause.perl.org>) even upload it.
ja: And if you have a PAUSE account (which can be requested at [[http://pause.perl.org]]) even upload it.

source: And if you have multiple routes using restrictive placeholders you can also turn them into placeholder types with L<Mojolicious::Routes/"add_type">.
ja: And if you have multiple routes using restrictive placeholders you can also turn them into placeholder types with [[Mojolicious::Routes/"add_type"]].

source: And then implement a C<BUILD_DYNAMIC> method in your class, making sure that the key you use to lookup methods in C<$dyn_methods> is the same thing you pass as C<$ref> to L</"register">.
ja: And then implement a C<BUILD_DYNAMIC> method in your class, making sure that the key you use to lookup methods in C<$dyn_methods> is the same thing you pass as C<$ref> to [[/"register">.

source: And to add your helper to the application, you can use L<Mojolicious/"helper">.
ja: And to add your helper to the application, you can use [[Mojolicious/"helper"]].

source: And to make it esier to test HTTPS/WSS web services L<Mojo::UserAgent/"insecure"> will be activated by default for L</"ua">.
ja: And to make it esier to test HTTPS/WSS web services [[Mojo::UserAgent/"insecure"]] will be activated by default for [[/"ua"]].

source: And to make your commands application specific, just add a custom namespace to L<Mojolicious::Commands/"namespaces"> and use a class name like C<MyApp::Command::spy> instead of C<Mojolicious::Command::spy>.
ja: And to make your commands application specific, just add a custom namespace to [[Mojolicious::Commands/"namespaces"]] and use a class name like C<MyApp::Command::spy> instead of C<Mojolicious::Command::spy>.

source: And we do in fact already use several optional CPAN modules such as L<Cpanel::JSON::XS>, L<EV>, L<IO::Socket::Socks>, L<IO::Socket::SSL>, L<Net::DNS::Native>, L<Plack> and L<Role::Tiny> to provide advanced functionality if possible.
ja: And we do in fact already use several optional CPAN modules such as [[Cpanel::JSON::XS]], [[EV]], [[IO::Socket::Socks]], [[IO::Socket::SSL]], [[Net::DNS::Native]], [[Plack]] and [[Role::Tiny]] to provide advanced functionality if possible.

source: And you can use all the commands from L<Mojolicious::Commands>.
ja: And you can use all the commands from [[Mojolicious::Commands]].

source: And you don't have to worry about memory usage, because all files above 250KiB will be automatically streamed into a temporary file.
ja: メモリの使用率を気にする必要はありません。C<250KB>を超えるすべてのファイルは自動的に一時ファイルに保存されるからです。

source: Another good reverse proxy is L<Apache|http://httpd.apache.org> with C<mod_proxy>, the configuration looks quite similar to the Nginx one above.
ja: Another good reverse proxy is [[Apache|http://httpd.apache.org]] with C<mod_proxy>, the configuration looks quite similar to the Nginx one above.

source: Another huge advantage is that it supports TLS and WebSockets out of the box, a development certificate for testing purposes is built right in, so it just works, but you can specify all listen locations supported by L<Mojo::Server::Daemon/"listen">.
ja: Another huge advantage is that it supports TLS and WebSockets out of the box, a development certificate for testing purposes is built right in, so it just works, but you can specify all listen locations supported by [[Mojo::Server::Daemon/"listen"]].

source: Another positive side effect of this pattern is that we do not need to call L<Mojo::IOLoop/"start"> and L<Mojo::IOLoop/"stop"> manually, because we know exactly when our chain of L</"steps"> has reached the end.
ja: Another positive side effect of this pattern is that we do not need to call [[Mojo::IOLoop/"start"]] and [[Mojo::IOLoop/"stop"]] manually, because we know exactly when our chain of [[/"steps"]] has reached the end.

source: Any aspect of the application (helpers, plugins, routes, etc.) can be introspected from L<Test::Mojo> through the application object.
ja: Any aspect of the application (helpers, plugins, routes, etc.) can be introspected from [[Test::Mojo]] through the application object.

source: Any of the native Perl data types can be passed to templates as references through the L<Mojolicious::Controller/"stash">.
ja: Any of the native Perl data types can be passed to templates as references through the [[Mojolicious::Controller/"stash"]].

source: Append message to L</"handle">.
ja: Append message to [[/"handle"]].

source: Appends a fulfillment and rejection handler to the promise, and returns a new L<Mojo::Promise> object resolving to the original fulfillment value or rejection reason.
ja: Appends a fulfillment and rejection handler to the promise, and returns a new [[Mojo::Promise]] object resolving to the original fulfillment value or rejection reason.

source: Appends a rejection handler callback to the promise, and returns a new L<Mojo::Promise> object resolving to the return value of the callback if it is called, or to its original fulfillment value if the promise is instead fulfilled.
ja: Appends a rejection handler callback to the promise, and returns a new [[Mojo::Promise]] object resolving to the return value of the callback if it is called, or to its original fulfillment value if the promise is instead fulfilled.

source: Appends fulfillment and rejection handlers to the promise, and returns a new L<Mojo::Promise> object resolving to the return value of the called handler.
ja: Appends fulfillment and rejection handlers to the promise, and returns a new [[Mojo::Promise]] object resolving to the return value of the called handler.

source: Application for command, defaults to a L<Mojo::HelloWorld> object.
ja: Application for command, defaults to a [[Mojo::HelloWorld]] object.

source: Application server relative URLs will be processed with, defaults to a L<Mojo::UserAgent::Server> object.
ja: Application server relative URLs will be processed with, defaults to a [[Mojo::UserAgent::Server]] object.
